app/controllers/websites_controller.rb

SELECT "websites".* FROM "websites"
---
  def index
    @websites = Website.all

INSERT INTO "websites" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "http://example.com"], ["created_at", 2016-11-13 18:33:08 UTC], ["updated_at", 2016-11-13 18:33:08 UTC]]
---
  def create
    @website = Website.new(website_params)

    respond_to do |format|
      if @website.save

SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_website
      @website = Website.find(params[:id])